import React from "react";
import "bootstrap/dist/css/bootstrap.min.css";
import { Menu } from "..";
import { Footer } from "..";
import { Container, Col, Row } from "react-bootstrap";

export default function MenuThree() {
  return (
    <>
      <Menu />

      <Container className="p-3 my-3">
        <Row>
          <Col className="col-12 mb-3 itim">
            <img src="/menu3.webp" alt="asdasd" style={{ width: "100%" }} />
          </Col>
          <Col className="col-12 my-3 text-center">
            <h1>เกี๊ยวซ่า</h1>
          </Col>
          <Col className="col-12 mb-3">
            <p className="itim">
              ถือว่าเป็น เมนูอาหารญี่ปุ่น ที่เหมาะกับเป็นของว่างมาก ๆ สำหรับ
              เกี๊ยวซ่า ด้วยรสสัมผัสจากแป้งเกี๊ยวที่กรุบกรอบและไส้หมู ผักต่าง ๆ
              ที่สอดไส้อยู่ด้านใน พอจิ้มกับซอสโชยุที่ให้รสเปรี้ยว
              ก็จะทำให้ได้ความกรอบนอกนุ่มใน
              พร้อมรสชาติเปรี้ยวจี๊ดที่ช่วยให้อร่อยมากขึ้น ซึ่งเมนู เกี๊ยวซ่า
              นั้นถือว่าเป็นเมนูเกี๊ยวทอดที่ฮิตมากในประเทศญี่ปุ่น
              ก่อนที่จะได้รับความนิยมอย่างมากในประเทศไทย โดยสูตรและส่วนผสมต่าง ๆ
              มาจาก Youtuber ช่อง daddy cooking
            </p>
          </Col>
          <Col className="itim">
            <p className="itim">ส่วนผสม</p>
            <ul className="mt-3">
              <li>แผ่นเกี๊ยวซ่าสำเร็จรูป</li>
              <li>ผักกาดขาว 200 กรัม</li>
              <li>หมูบด 300 กรัม</li>
              <li>แป้งมัน 1 ช้อนโต๊ะ</li>
              <li>ต้นหอมซอย 1 ช้อนโต๊ะ</li>
              <li>ขิงสับละเอียด 1 ช้อนชา</li>
              <li>กระเทียมสับ 1 ช้อนโต๊ะ</li>
              <li>ซอสหอยนางรม 1 ช้อนโต๊ะ</li>
              <li>โซยุ 1 ช้อนโต๊ะ</li>
              <li>น้ำมันงา 1 ช้อนโต๊ะ</li>
              <li>น้ำตาลทราย 1 ช้อนโต๊ะ</li>
              <li>พริกไทย 1/2 ช้อนชา</li>
            </ul>
          </Col>

          <Col className="col-12 mb-3 itim">
            <p className="itim">วิธีทำ</p>
            <ol className="mt-3">
              <li>
                นำผักกาดขาวมาสับให้ละเอียด โรยเกลือลงไป คลุกให้เข้ากัน
                พักทิ้งไว้ 10 นาที จากนั้น นำมาใส่ผ้าขาวบาง
                บีบเอาน้ำจากกะหล่ำปลีออก
              </li>
              <li>
                ทำไส้เกี๊ยวซ่า โดยเตรียมชามผสมอาหาร ใส่หมูบด ซอสโชยุ ซอสหอยนางรม
                น้ำตาลทราย พริกไทยป่น น้ำมันงา คลุกให้เข้ากัน
              </li>
              <li>
                จากนั้น ใส่แป้งมันลงไป นวดให้เข้ากัน ตามด้วยขิงสับละเอียด
                กระเทียมสับ ผักกาดขาว ต้นหอมซอย คลุกเคล้าทุกอย่างเข้าด้วยกัน
                เป็นเนื้อเดียว
              </li>
              <li>
                ตักไส้มา 1 ช้อนโต๊ะ วางลงบนแผ่นแป้ง แล้วจับจีบประกบกัน
                วางลงในถาดที่คลุมด้วยผ้าขาวบาง ไม่ให้โดนลม
              </li>
              <li>
                เมื่อทำครบหมดแล้ว ให้นำไปทอด โดยควรใช้กระทะเทฟล่อน
                เพื่อไม่ให้แป้งติดกระทะ แต่ถ้าไม่มี ให้ทาน้ำมันรอบกระทะก่อน
                แล้วเริ่มทอด โดยการเทน้ำมัน ให้เทน้ำมันลงบนแผ่นแป้งเกี๊ยวซ่า
                เพื่อให้แป้งมีความกรอบ ใช้ไฟกลาง
                ทอดไปสักพักจนแป้งด้านล่างเริ่มกรอบ หรือส่งกลิ่นหอม
                ให้เติมน้ำเปล่า หรือน้ำสต็อกลงไปประมาณครึ่งแผ่นเกี๊ยว จากนั้น
                ปิดฝาอบทิ้งไว้ 10 นาที
              </li>
              <li>
                เมื่อไส้เกี๊ยวเริ่มสุกได้ที่ ให้นำฝาออก แล้วทอดต่อไป
                จนเมื่อน้ำในกระทะเริ่มแห้งดีแล้ว ให้นำกระดาษซับมันวางลงไป
                ตามด้วยจาน แล้วพลิกกระทะ จัดจานเสิร์ฟพร้อมซอสโชยุ
                ก็เป็นอันเสร็จเรียบร้อย
              </li>
            </ol>
          </Col>
        </Row>
      </Container>

      <Footer />
    </>
  );
}
